{
    "settings": {
        "intro": "LEDitor offers the possibility to create customized LED Ring animations. The animations can be selected with flow cards and played for an adjustable time.",
	"header_frame": "&nbsp;Frame",
        "header_colors": "&nbsp;Color pattern",
        "animation_button_copy": "Copy mode",
        "frame_button_add": "Add a new frame after frame ###",
        "frame_button_copy": "Duplicate frame ###",
        "frame_button_push": "Move backwards",
        "frame_button_pull": "Move forward",
        "frame_button_clock": "Move clockwise",
        "frame_button_counterclock": "Move counterclockwise",
	"frame_count": "Frames",
	"used": "Used",
	"free": "Free",
	"move_up": "Move up",
	"move_down": "Move down",
	"remove": "Remove",
	"updated": "Updated",
	"ed_apply_off": "Off",
	"ed_fill_equal": "Fill solid",
	"ed_fill_gradient": "Fill with gradient",
	"txt_undo": "Undo",
	"txt_redo": "Redo",

	"txt_processing": "Processing",
	"txt_led_setting": "LED setting",
	"txt_range": "Range",
	"txt_drop_type_1": "One or more",
	"txt_drop_type_2": "Skip to...",
	"txt_drop_type_3": "Fill with gradient",
	"txt_drop_range_t1": "### LED",
	"txt_drop_range_t2": "every ### LED",
	"txt_drop_range_t3": "inactive LEDs",
	"txt_plural_s": "s",
	"txt_select": "Select",
	"txt_pure_red": "Pure red",
	"txt_pure_green": "Pure green",
	"txt_pure_blue": "Pure blue",
	"txt_pure_yellow": "Pure yellow",
	"txt_pure_magenta": "Pure magenta",
	"txt_pure_cyan": "Pure cyan",
	"txt_no_color": "No color - LED off",
	"txt_bright_white": "Bright white",
	"count0": "every",
	"count1": "1st",
	"count2": "2nd",
	"count3": "3rd",
	"count4": "4th",
	"count5": "5th",
	"count6": "6th",
	"count7": "7th",
	"count8": "8th",
	"count9": "9th",
	"count10": "10th",
	"count11": "11th",
	"count12": "12th",
	"txt_ledring": "LED ring display is approximate",

	"txt_import_start": "Start here and open an image.",
	"txt_led_colors": "Imported colors",
	"txt_image_selection": "Image selection",
	"txt_dimmer": "Dimmer",
	"txt_hue": "Hue",
	"txt_saturation": "Saturation",
	"txt_lightness": "Lightness",
	"txt_zoom": "Zoom",
	"txt_open_image": "Open an image",
	"txt_scan_direction": "Scan direction",
	"txt_left_right": "Left to right",
	"txt_top_bottom": "Top to bottom",
	"txt_import_cancel": "Cancel",
	"txt_import_accept": "Accept",


	"help_but_copy_ani_A": "Activate Copy mode to replace the selected animation with a copy of the subsequent selection. <br> Example: Select animation 1, activate Copy mode, choose animation 3. Animation 1 is now replaced with a copy of animation 3.",
	"help_but_copy_ani_B": "Deactivate Copy mode.",
	"help_dropAnimation_A": "Select an animation. Any changes to the current animation can no longer be undone automatically. Manual changes are always possible.",
	"help_dropAnimation_B": "COPY MODE: The current animation is replaced by a copy of the animation to be selected.",
	"help_but_rename_ani": "Change the name of the selected animation.",
	"help_inName": "Rename the animation and click the Rename button.",
	"help_inFPS": "FPS = Frames Per Second. This setting determines how many LED frames per second are displayed.",
	"help_inTFPS": "IFPS = Interpolated Frames Per Second. This setting determines the final speed at which the LED ring changes. When IFPS is higher than FPS, Homey will insert the missing frames. A value equivalent to FPS ensures an immediate frame change. A high setting (from 25-30 IFPS) results in a smooth display.",
	"help_inRPM": "RPM = Rotations Per Minute. How many times per minute the whole animation completes a revolution. 0 = Stationary with LED 1 facing forward. At positive values, the ring turns clockwise, and negative values turn the ring counterclockwise.",
	"help_butPlay": "Play an example animation on the screen. This may be useful when Homey is unavailable. This display is only approximately the same as the actual LED ring display.",
	"help_butPreview": "Play the animation with Homey. You can optionally set a number of repetitions so that the transition from the end to the beginning of the animation becomes clearly visible.",
	"help_inRepeat": "How many times should Homey repeat the animation test.",
	"help_tableFrames": "This is a view of the frames. Larger markers show LEDs 1 (front), 7 (left), 13 (rear) and 19 (right). LED 1 is visible in the center while LED 13 is visible both left and right on the bar to emphasize the circular reality. Select a frame to see the ring view and make any adjustments.",
	"help_butTopColor": "Choose a background color for the screen views. Possible are black, 33% gray, 66% gray and white. This can help to better recognize very dark or very bright, near-white colors.",
	"help_ledMarker": "Move your mouse over these little squares to see which LEDs will be edited with the current setting. Click on a square to perform the selected operation.",
	"help_colPreview": "Select an edit color or choose 'off'",
	"help_dropFillType": "Choose a type of processing.",
	"help_dropFillType1": "'#1#' = Edit 1 LED or a number of consecutive LEDs.",
	"help_dropFillType1ext": "",
	"help_dropFillType2": "'#2#' = Skip one or more LEDs before editing the next one.",
	"help_dropFillType2ext": "",
	"help_dropFillType3": "'#3#' = A group of inactive LEDs inbetween 2 active LEDs gets a smooth gradient.",
	"help_dropFillType3ext": "If only 1 LED is on or when the two adjacent LEDs are the same color, a solid fill will be performed.",
	"help_dropFillRange": "Select the processing range for",
	"help_but_frame_clock": "Turn the colors clockwise.",
	"help_but_frame_counterclock": "Turn the colors counterclockwise.",
	"help_but_frame_push": "Move the colors at the left and right backwards. LEDs 1 and 13 do not change.",
	"help_but_frame_pull": "Move the colors at the left and right forward. LEDs 1 and 13 do not change.",
	"help_but_edit_fill": "Solid fill. Each inactive LED gets the same color as the previous active LED.",
	"help_but_edit_flow": "Color gradient fill. All inactive LEDs form a smooth gradient between the active LEDs. Unlike the 'Fill with gradient' function, this feature edits all inactive sections simultaneously.",
	"help_but_frame_add": "Add a new frame after the selected frame.",
	"help_but_frame_copy": "Add a copy after the selected frame.",
	"help_but_image_import": "Use an image as animation source. The current animation is replaced by frames that are formed from the pixels of a self-chosen image. Use various settings to adjust the colors. The number of frames is adjustable from 1 to 200.",
	"help_but_edit_undo": "Undo the last edit. This is possible until you select another animation or leave this settings page.",
	"help_but_edit_redo": "Redo the undone edit. This is possible until you select another animation or leave this settings page.",

	"help_sliderDimmer": "Use Dimmer to darken the original colors. This prevents adjacent colors from mixing too much, which can result in a boring, almost white-lit LED ring. Use your mouse wheel or cursor keys for fine tuning. A double-click sets the default value.",
	"help_sliderHue": "Hue allows you to customize the color spectrum of an image. Use your mouse wheel or cursor keys for fine tuning. A double-click sets the default value.",
	"help_sliderSaturation": "Use Saturation to make dull colors brighter and vice versa. Use the minimum setting for grayscale / white levels. Use your mouse wheel or cursor keys for fine tuning. A double-click sets the default value.",
	"help_sliderLightness": "Lightness makes the colors darker or brighter. Dark shades are more affected than light shades. Use your mouse wheel or cursor keys for fine tuning. A double-click sets the default value.",
	"help_sliderZoom": "Use Zoom to increase a particular part of an image. The last mouse click in an image determines the center of magnification. Use your mouse wheel or cursor keys for fine tuning. A double click shows the full image.",
	"help_but_open_image": "Open an image as a source for frames and LED colors.",
	"help_but_scan_direction": "Select whether the frames are scanned from left to right, or from top to bottom.",
	"help_inFrames": "Determine the number of frames in which the selection is divided.",
	"help_canvImage": "Click on the image to determine the center of the part to be used. This is also the point that may be zoomed in.",
	"help_importArea": "This area of the image is used to import the frames and colors and also instantly displays all color adjustments. Move the mouse in the longitudinal direction to view the frames in the matrix view.",
	"help_canvImportedFrames": "Here you will see how the colors from an image are used in frames. Frames are displayed from top to bottom. Each frame displays 24 LED colors from left to right. Disabled LEDs are displayed with a dot. The central vertical marker shows the position of LED 1.",
	"help_but_import_cancel": "Return to the editor without importing the image. As long as you do not leave the LEDitor settings, you can return here to continue working with the current image.",
	"help_but_import_accept": "Accept the displayed settings. All existing frames of the selected animation will be erased and replaced by the new image frames. As long as you do not leave the LEDitor settings, you can return here to make adjustments."
    }
}